Revit 2027 API
FamilyStructuralMaterialTypeFilter(StructuralMaterialType) Constructor
 Constructs a new instance of a filter to match families that have the given structural material type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyStructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType
)
Public Sub New (
	structuralMaterialType As StructuralMaterialType
)
public:
FamilyStructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType
)
new :
        structuralMaterialType : StructuralMaterialType -> FamilyStructuralMaterialTypeFilter
Parameters
structuralMaterialType StructuralMaterialType
 The structural material type to match.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FamilyStructuralMaterialTypeFilter Class
FamilyStructuralMaterialTypeFilter Overload
Autodesk.Revit.DB.Structure Namespace